let checkCentury = document.getElementById('travel').addEventListener("click", checkcentury);


let i = [  
  ['1. Рим был самым крупным городом в мире:  Մ.թ. 1-ին Հռոմը, 800,000-ից մինչև 1 միլիոն բնակիչ ունեցող, աշխարհի ամենամեծ և ամենահզոր քաղաքն էր: Այն, ինչ մենք գիտենք այս հնագույն դարաշրջանի քաղաքակրթության մասին, մեզ հայտնի է հռոմեական տիրապետության ժամանակ արձանագրված պատմությունից:'],
  ['Աշխարհի բնակչությունը կազմում էր մոտ 231 միլիոն մարդ։Հստակ թիվը գրեթե անհնար է իմանալ, սակայն որոշ գնահատականներով Երկրի բնակչությունը կազմում էր մոտ 200 միլիոն մարդ։ Ամենաբնակեցված տարածքները եղել են Գանգեսի, Տիգրիսի, Յանցզիի, Նեղոսի և Պոյի մոտ հիմնադրված համայնքները։'],
  ['Տարածված էր վաղ ամուսնությունը: Հրեա աղջիկներն, օրինակ, ամուսնացել են 12,5 տարեկանում։ Այդ օրերին ամուսնությունը կնքվում էր երկու փուլով. Պաշտոնական նշանադրությունը պայմանավորվել է ամուսնու և աղջկա հոր միջև։ Մի քանի ամիս անց աղջիկը տեղափոխվեց ամուսնու տուն։ Տեղափոխությունից հետո միայն ամուսնությունը համարվեց պաշտոնական։'],
  ['Կանայք չունեին կամ ունեին խիստ սահմանափակ իրավական և տնտեսական իրավունքներ: Կինը հազվադեպ էր տնտեսապես անկախ: Կնոջ վաստակն ուղղակիորեն գնում էր իր հորը կամ ամուսնուն՝ կախված նրա ամուսնական կարգավիճակից: Իրավական առումով կանայք իրավունք չունեին ամուսնալուծության հայց ներկայացնելու, մինչդեռ տղամարդիկ կարող էին հրամայել լքել իրենց կնոջը: Մյուս կողմից, տղամարդը պետք է վստահ լիներ, որ կարող է փրկագին տալ իր կնոջը, եթե իրեն գերեին։'],
  ['Առաջին ավտոմատները սուրբ ջուր են վաճառել: Վաճառքի մեքենաները հայտնագործվել են մեր թվարկության առաջին դարում Ալեքսանդրիա քաղաքում: Սակայն այս քաղաքի բնակիչները գնել են ոչ թե չիպսեր և գազավորված ջուր, այլ սուրբ ջուր։ Երբ մետաղադրամն ընկավ անցքի մեջ, դրա ծանրությունը խցանը հանեց ծորակից, և ապարատը սուրբ ջուր էր մատակարարում։'],

];
let ii = [  
   ['Գիտություն. Այս ընթացքում աստղագիտության և մաթեմատիկայի ուսումնասիրությունը կարևոր առաջընթաց է գրանցել, որոնցում այնպիսի գիտնականներ, ինչպիսիք են Պտղոմեոսը և Հիպարքոսը, նշանակալի ներդրում են ունեցել այս ոլորտներում:'],
   ['Բժշկություն. Հունական բժշկական տեքստերն ու պրակտիկաները, ներառյալ Գալենի գործերը, շարունակեցին լայնորեն օգտագործվել և ուսումնասիրվել Հռոմեական կայսրությունում և դրանից դուրս:'],
   ['Տեխնոլոգիա. Երկրորդ դարում զարգանում են նոր տեխնոլոգիաներ, ինչպիսիք են ջրաղացի գյուտը և ապակե ոսպնյակների արտադրությունը, որոնք կարևոր կիրառումներ են ունեցել տարբեր ոլորտներում:'],
   ['Արվեստ և գրականություն. Երկրորդ դարում ստեղծվեցին արվեստի և գրականության տարբեր գործեր, ներառյալ հույն բանաստեղծ Լուկիանոսի, հռոմեացի բանաստեղծ Յուվենալի և փիլիսոփա Մարկուս Ավրելիոսի գրվածքները, որոնց ստեղծագործությունները շարունակում են լայնորեն ընթերցվել և ուսումնասիրվել այսօր:'],
   ['Մետաքսի ճանապարհ. Մետաքսի ճանապարհը՝ Արևելքն ու Արևմուտքը կապող առևտրային ուղիների ցանց, շարունակեց կարևոր դեր խաղալ առևտրի և առևտրի հեշտացման գործում երկրորդ դարում: Մետաքսի ճանապարհը թույլ տվեց ապրանքների, տեխնոլոգիաների և մշակութային գաղափարների փոխանակում Չինաստանի, Հնդկաստանի, Հռոմեական կայսրության և այլ տարածաշրջանների միջև:']
  ];

function checkcentury() {

  let password = document.querySelector('#password').value;
  let randomNumber = Math.floor(Math.random() * 5);
  if (password == 1 ) {
    document.getElementById('div').innerHTML = i[randomNumber][0];
  } else if ( password ==2 ) {
    document.getElementById('div').innerHTML = ii[randomNumber][0];

  } else {
    alert('սխալ արժեք արժեքը կարող է լինել 0-21թվերի միջակայքում');
  }
}

